food-swipe/app/controllers/users_controller.rb

  def update
    p params
    if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$qqxVnvoKaPpUjHti7CWFNOKVHB4p2ckHZYjSAs2C/86zUqZd7LaH2"], ["updated_at", "2020-03-16 19:19:42.486328"], ["id", 3]]

  def add_liked_food
    @liked_foods = @current_user.foods
    @food_to_like = Food.find(params[:food_id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]